iarsystems/ewarm-toshiba-example-projects/TMPM4NR/Libraries/startup/startup_TMPM4NR.s
                PUBWEAK INTTSSI0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0TX_IRQHandler
                B       INTTSSI0TX_IRQHandler

                PUBWEAK INTTSSI0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI0ERR_IRQHandler
                B       INTTSSI0ERR_IRQHandler

                PUBWEAK INTTSSI1RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI1RX_IRQHandler
                B       INTTSSI1RX_IRQHandler

                PUBWEAK INTTSSI1TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI1TX_IRQHandler
                B       INTTSSI1TX_IRQHandler

                PUBWEAK INTTSSI1ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTSSI1ERR_IRQHandler
                B       INTTSSI1ERR_IRQHandler

                PUBWEAK INTEMA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEMA_IRQHandler
                B       INTEMA_IRQHandler

                PUBWEAK INTEMAMP_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEMAMP_IRQHandler
                B       INTEMAMP_IRQHandler

                PUBWEAK INTCANARXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANARXD_IRQHandler
                B       INTCANARXD_IRQHandler

                PUBWEAK INTCANATXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANATXD_IRQHandler
                B       INTCANATXD_IRQHandler

                PUBWEAK INTCANAGLB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANAGLB_IRQHandler
                B       INTCANAGLB_IRQHandler

                PUBWEAK INTCANBRXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANBRXD_IRQHandler
                B       INTCANBRXD_IRQHandler

                PUBWEAK INTCANBTXD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANBTXD_IRQHandler
                B       INTCANBTXD_IRQHandler

                PUBWEAK INTCANBGLB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANBGLB_IRQHandler
                B       INTCANBGLB_IRQHandler

                PUBWEAK INTUSBOTGA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUSBOTGA_IRQHandler
                B       INTUSBOTGA_IRQHandler

                PUBWEAK INTUSBOTGAWK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUSBOTGAWK_IRQHandler
                B       INTUSBOTGAWK_IRQHandler

                PUBWEAK INTUSBOTGB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUSBOTGB_IRQHandler
                B       INTUSBOTGB_IRQHandler

                PUBWEAK INTUSBOTGBWK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUSBOTGBWK_IRQHandler
                B       INTUSBOTGBWK_IRQHandler

                PUBWEAK INTT32A14_A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_A_IRQHandler
                B       INTT32A14_A_IRQHandler

                PUBWEAK INTT32A14_B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_B_IRQHandler
                B       INTT32A14_B_IRQHandler

                PUBWEAK INTT32A14_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A14_CT_IRQHandler
                B       INTT32A14_CT_IRQHandler

                PUBWEAK INTT32A15_A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_A_IRQHandler
                B       INTT32A15_A_IRQHandler

                PUBWEAK INTT32A15_B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_B_IRQHandler
                B       INTT32A15_B_IRQHandler

                PUBWEAK INTT32A15_C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A15_C_IRQHandler
                B       INTT32A15_C_IRQHandler

                PUBWEAK INTMDMAADISR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMDMAADISR_IRQHandler
                B       INTMDMAADISR_IRQHandler

                END
